"""4. ახსენით სამივე მაგალითი რაც ჩაგდებულია რესურსებში."""

"""2) natural language:"""

"""natural language არის ბუნებრივ ენაზე დაწერილი კოდი ინგლისურად ამ მაგალითში მომხმარებელი იყვანს რეგისტრაციის დეტალებს შემდგომ ამოწმებს თუ რეგისტრაცია არის ავტორიზებული ანუ თუ უკვე დარეგისტრილებულია, შემდგომ თუ წვდომა აქვს შესვლაზე შემდგომაც თუ არა, განაგრძობს მომხმარებელი მოთხოვნას რომ შეუშვას. შემდგომ ავტორიზაციამდე შესვლას მოითხოვს როდესაც user დარეგისტრილდება."""

"""1) pseudo code:"""

"""pseudo code ნაკლებად ჰგავს რამე პროგრამირების ენის კოდს, მაგრამ ის არ არის პროგრამირების ენა უბრალოდ ინგლისურად არის დაწერილი მისი კოდის ლოგიკა უშუალოდ კოდის მუშაობა პირველი რომ კოდი უნდა დაიწყოს მეორე რომ იმეორებს რაღაცას სანამ პირობა არის True მესამე user input - log_in ხოლო, მეოთხე თუ ნებადართულია წვდომა პირობა ხდება ჭეშმარიტი user იც უკვე შემოვა ვებ საიტზე"""


"""Flow Chart:"""


"Flow Chart ში იღწერება კოდის ნაწილი ჯერ გვიწევს start - დაწყება ანუ დავიწყოთ კოდის წერა მომხმარებლებისთვის შემდგომ Log in - შესვლა რათა, user შევიდეს ვებ საიტზე როდესაც შემოვაყვანინებთ მას მის, მონაცემებს Authorized - ავტორიზებული, ამის შემდეგ მომხმარებელი ავტორიზებულია ეს ნიშნავს რომ მან გაიარა ავტორიზაცია, იგივე რეგისტრაცია და შეუძლია შევიეს ვებ საიტზე მაგრამ საბოლოო, და ყველაზე მთავარი Access granted. - წვდომა დაშვებულია მომხმარებელს, აუცილებლად უნდა ჰქონდეს დაშვებული წვდომა ვებ საიტზე სხვა შემთხვევაში ვერ შევა თუ ავტორიზაცია იქნება True ანუ ნამდვილად თუ შევიდა პირობა გახდება True ხოლო, სხვა შემთხვევაში პირობა გამოიანგარიშება როგორც False იგივე ტყუილი, და user ვერ შევა ვებ საიტზე."